// ยาที่แนะนำสำหรับแต่ละประเภทแผล
export const medicineRules: Record<string, string[]> = {
  cut_small: [
    "น้ำเกลือล้างแผล",
    "ผ้าก๊อซปลอดเชื้อ",
    "พลาสเตอร์ปิดแผล",
    "เทปปิดแผล",
    "แผ่นดึงขอบแผล",
    "ยาฆ่าเชื้อใส่แผล",
    "พาราเซตามอล"
  ],

  cut_large: [
    "ผ้าก๊อซหนา",
    "ผ้าพันแผล",
    "แผ่นปิดแผลปลอดเชื้อขนาดใหญ่",
    "น้ำเกลือสำหรับการดูแลแผลตามคำแนะนำบุคลากรทางการแพทย์",
    "พาราเซตามอล"
  ],

  abrasion: [
    "น้ำเกลือล้างแผล",
    "ผ้าก๊อซ",
    "Hydrocolloid",
    "ไฮโดรเจลแพด",
    "พลาสเตอร์แผลถลอก",
    "ยาฆ่าเชื้อใส่แผล",
    "พาราเซตามอล"
  ],

  burn: [
    "ผ้าก๊อซแบบไม่ติดแผล",
    "ไฮโดรเจลแพด",
    "น้ำเกลือ",
    "พาราเซตามอล",
    "ครีมสำหรับแผลไหม้"
  ],

  bruise: [
    "อุปกรณ์สำหรับประคบเย็น",
    "ผ้ายืดพันเคล็ด",
    "เจลบรรเทาอาการฟกช้ำ",
    "พาราเซตามอล"
  ]
};
